<?php
$flo = array(
	'Q1' => array('設問'=>'薔薇','回答1'=>'バラ','回答2'=>'ローズ','回答3'=>'チューリップ','回答4'=>'ヒマワリ'),
	'Q2' => array('設問'=>'紫陽花','回答1'=>'アジサイ','回答2'=>'ローズ','回答3'=>'チューリップ','回答4'=>'ヒマワリ'),
	'Q3' => array('設問'=>'椿','回答1'=>'ツバキ','回答2'=>'ローズ','回答3'=>'チューリップ','回答4'=>'ヒマワリ')
);

// $array2 = [
// 	'Q1' => ['設問'=>'薔薇','回答1'=>'バラ','回答2'=>'ローズ','回答3'=>'チューリップ','回答4'=>'ヒマワリ'],
// 	'Q2' => ['設問'=>'紫陽花','回答1'=>'アジサイ','回答2'=>'ローズ','回答3'=>'チューリップ','回答4'=>'ヒマワリ'],
// 	'Q3' => ['設問'=>'椿','回答1'=>'ツバキ','回答2'=>'ローズ','回答3'=>'チューリップ','回答4'=>'ヒマワリ']
// ];


foreach($flo as $key3 => $val3){
	echo '<h3>'.$key3.' '.$flo[$key3]["設問"].'</h3>';
	foreach($flo[$key3] as $key4 => $val4){
		if($key4 != '設問'){
			echo '<label><input type="radio" name="'.$key3.'" value="'.$val4.'">'.$val4.'</label><br>';
		}
	}
}


?>
